{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"outputs": {"softmax/Softmax": {"name": "softmax/Softmax"}}}}, "modelTopology": {"node": [{"name": "fire9_expand_1x1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire9_expand_1x1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "fire7_expand_1x1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "192"}]}}}}}, {"name": "fire7_expand_1x1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire6_expand_1x1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "192"}]}}}}}, {"name": "fire6_expand_1x1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire5_expand_1x1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "128"}]}}}}}, {"name": "fire5_expand_1x1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire4_expand_1x1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "128"}]}}}}}, {"name": "fire4_expand_1x1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "fire3_expand_1x1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "64"}]}}}}}, {"name": "fire3_expand_1x1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire2_expand_1x1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "64"}]}}}}}, {"name": "fire2_expand_1x1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "100"}, {"size": "100"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire7_squeeze_bn/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "conv1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "fire2_squeeze/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "16"}]}}}}}, {"name": "fire7_squeeze_bn/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire2_squeeze/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "fire2_squeeze_bn/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "fire2_squeeze_bn/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "conv10/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "7"}]}}}}}, {"name": "fire2_expand_3x3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire2_expand_3x3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "fire7_expand_3x3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire2_expand_merge/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "fire3_squeeze/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}}}}}, {"name": "conv10/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire3_squeeze/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "fire7_expand_3x3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire3_squeeze_bn/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire3_squeeze_bn/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "fire3_expand_3x3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire7_expand_merge/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "fire3_expand_3x3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire3_expand_merge/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "fire4_squeeze/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "32"}]}}}}}, {"name": "fire4_squeeze/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "fire9_squeeze/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}}}, {"name": "fire4_squeeze_bn/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "fire4_squeeze_bn/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire9_squeeze/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire4_expand_3x3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "128"}]}}}}}, {"name": "conv10_bn/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire4_expand_3x3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "fire4_expand_merge/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "fire5_squeeze/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire9_squeeze_bn/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "fire5_squeeze/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire5_squeeze_bn/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "fire5_squeeze_bn/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "fire9_squeeze_bn/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "fire5_expand_3x3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire5_expand_3x3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv10_bn/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire5_expand_merge/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "fire6_squeeze/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire6_squeeze/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "fire9_expand_3x3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire6_squeeze_bn/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire6_squeeze_bn/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire9_expand_3x3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "fire6_expand_3x3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "192"}]}}}}}, {"name": "avgpool10/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "fire6_expand_3x3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire6_expand_merge/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "fire7_squeeze/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "48"}]}}}}}, {"name": "fire9_expand_merge/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "fire7_squeeze/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "conv1/Relu", "op": "_FusedConv2D", "input": ["input_2", "conv1/kernel", "conv1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "maxpool1/MaxPool", "op": "MaxPool", "input": ["conv1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "fire2_squeeze/Relu", "op": "_FusedConv2D", "input": ["maxpool1/MaxPool", "fire2_squeeze/kernel", "fire2_squeeze/bias"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "fire2_squeeze_bn/batchnorm/mul_1", "op": "Mul", "input": ["fire2_squeeze/Relu", "fire2_squeeze_bn/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire2_squeeze_bn/batchnorm/add_1", "op": "Add", "input": ["fire2_squeeze_bn/batchnorm/mul_1", "fire2_squeeze_bn/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire2_expand_1x1/Relu", "op": "_FusedConv2D", "input": ["fire2_squeeze_bn/batchnorm/add_1", "fire2_expand_1x1/kernel", "fire2_expand_1x1/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "fire2_expand_3x3/Relu", "op": "_FusedConv2D", "input": ["fire2_squeeze_bn/batchnorm/add_1", "fire2_expand_3x3/kernel", "fire2_expand_3x3/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "fire2_expand_merge/concat", "op": "ConcatV2", "input": ["fire2_expand_1x1/Relu", "fire2_expand_3x3/Relu", "fire2_expand_merge/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "fire3_squeeze/Relu", "op": "_FusedConv2D", "input": ["fire2_expand_merge/concat", "fire3_squeeze/kernel", "fire3_squeeze/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "fire3_squeeze_bn/batchnorm/mul_1", "op": "Mul", "input": ["fire3_squeeze/Relu", "fire3_squeeze_bn/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire3_squeeze_bn/batchnorm/add_1", "op": "Add", "input": ["fire3_squeeze_bn/batchnorm/mul_1", "fire3_squeeze_bn/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire3_expand_1x1/Relu", "op": "_FusedConv2D", "input": ["fire3_squeeze_bn/batchnorm/add_1", "fire3_expand_1x1/kernel", "fire3_expand_1x1/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "fire3_expand_3x3/Relu", "op": "_FusedConv2D", "input": ["fire3_squeeze_bn/batchnorm/add_1", "fire3_expand_3x3/kernel", "fire3_expand_3x3/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "fire3_expand_merge/concat", "op": "ConcatV2", "input": ["fire3_expand_1x1/Relu", "fire3_expand_3x3/Relu", "fire3_expand_merge/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "fire4_squeeze/Relu", "op": "_FusedConv2D", "input": ["fire3_expand_merge/concat", "fire4_squeeze/kernel", "fire4_squeeze/bias"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "fire4_squeeze_bn/batchnorm/mul_1", "op": "Mul", "input": ["fire4_squeeze/Relu", "fire4_squeeze_bn/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire4_squeeze_bn/batchnorm/add_1", "op": "Add", "input": ["fire4_squeeze_bn/batchnorm/mul_1", "fire4_squeeze_bn/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire4_expand_1x1/Relu", "op": "_FusedConv2D", "input": ["fire4_squeeze_bn/batchnorm/add_1", "fire4_expand_1x1/kernel", "fire4_expand_1x1/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "fire4_expand_3x3/Relu", "op": "_FusedConv2D", "input": ["fire4_squeeze_bn/batchnorm/add_1", "fire4_expand_3x3/kernel", "fire4_expand_3x3/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}}}, {"name": "fire4_expand_merge/concat", "op": "ConcatV2", "input": ["fire4_expand_1x1/Relu", "fire4_expand_3x3/Relu", "fire4_expand_merge/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "maxpool4/MaxPool", "op": "MaxPool", "input": ["fire4_expand_merge/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "fire5_squeeze/Relu", "op": "_FusedConv2D", "input": ["maxpool4/MaxPool", "fire5_squeeze/kernel", "fire5_squeeze/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "fire5_squeeze_bn/batchnorm/mul_1", "op": "Mul", "input": ["fire5_squeeze/Relu", "fire5_squeeze_bn/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire5_squeeze_bn/batchnorm/add_1", "op": "Add", "input": ["fire5_squeeze_bn/batchnorm/mul_1", "fire5_squeeze_bn/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire5_expand_1x1/Relu", "op": "_FusedConv2D", "input": ["fire5_squeeze_bn/batchnorm/add_1", "fire5_expand_1x1/kernel", "fire5_expand_1x1/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "fire5_expand_3x3/Relu", "op": "_FusedConv2D", "input": ["fire5_squeeze_bn/batchnorm/add_1", "fire5_expand_3x3/kernel", "fire5_expand_3x3/bias"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "fire5_expand_merge/concat", "op": "ConcatV2", "input": ["fire5_expand_1x1/Relu", "fire5_expand_3x3/Relu", "fire5_expand_merge/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "fire6_squeeze/Relu", "op": "_FusedConv2D", "input": ["fire5_expand_merge/concat", "fire6_squeeze/kernel", "fire6_squeeze/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "fire6_squeeze_bn/batchnorm/mul_1", "op": "Mul", "input": ["fire6_squeeze/Relu", "fire6_squeeze_bn/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire6_squeeze_bn/batchnorm/add_1", "op": "Add", "input": ["fire6_squeeze_bn/batchnorm/mul_1", "fire6_squeeze_bn/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire6_expand_1x1/Relu", "op": "_FusedConv2D", "input": ["fire6_squeeze_bn/batchnorm/add_1", "fire6_expand_1x1/kernel", "fire6_expand_1x1/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "fire6_expand_3x3/Relu", "op": "_FusedConv2D", "input": ["fire6_squeeze_bn/batchnorm/add_1", "fire6_expand_3x3/kernel", "fire6_expand_3x3/bias"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}}, {"name": "fire6_expand_merge/concat", "op": "ConcatV2", "input": ["fire6_expand_1x1/Relu", "fire6_expand_3x3/Relu", "fire6_expand_merge/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "fire7_squeeze/Relu", "op": "_FusedConv2D", "input": ["fire6_expand_merge/concat", "fire7_squeeze/kernel", "fire7_squeeze/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "fire7_squeeze_bn/batchnorm/mul_1", "op": "Mul", "input": ["fire7_squeeze/Relu", "fire7_squeeze_bn/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire7_squeeze_bn/batchnorm/add_1", "op": "Add", "input": ["fire7_squeeze_bn/batchnorm/mul_1", "fire7_squeeze_bn/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire7_expand_1x1/Relu", "op": "_FusedConv2D", "input": ["fire7_squeeze_bn/batchnorm/add_1", "fire7_expand_1x1/kernel", "fire7_expand_1x1/bias"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "fire7_expand_3x3/Relu", "op": "_FusedConv2D", "input": ["fire7_squeeze_bn/batchnorm/add_1", "fire7_expand_3x3/kernel", "fire7_expand_3x3/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "fire7_expand_merge/concat", "op": "ConcatV2", "input": ["fire7_expand_1x1/Relu", "fire7_expand_3x3/Relu", "fire7_expand_merge/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "maxpool8/MaxPool", "op": "MaxPool", "input": ["fire7_expand_merge/concat"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "fire9_squeeze/Relu", "op": "_FusedConv2D", "input": ["maxpool8/MaxPool", "fire9_squeeze/kernel", "fire9_squeeze/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "fire9_squeeze_bn/batchnorm/mul_1", "op": "Mul", "input": ["fire9_squeeze/Relu", "fire9_squeeze_bn/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire9_squeeze_bn/batchnorm/add_1", "op": "Add", "input": ["fire9_squeeze_bn/batchnorm/mul_1", "fire9_squeeze_bn/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "fire9_expand_1x1/Relu", "op": "_FusedConv2D", "input": ["fire9_squeeze_bn/batchnorm/add_1", "fire9_expand_1x1/kernel", "fire9_expand_1x1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "fire9_expand_3x3/Relu", "op": "_FusedConv2D", "input": ["fire9_squeeze_bn/batchnorm/add_1", "fire9_expand_3x3/kernel", "fire9_expand_3x3/bias"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "fire9_expand_merge/concat", "op": "ConcatV2", "input": ["fire9_expand_1x1/Relu", "fire9_expand_3x3/Relu", "fire9_expand_merge/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "conv10/Relu", "op": "_FusedConv2D", "input": ["fire9_expand_merge/concat", "conv10/kernel", "conv10/bias"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv10_bn/batchnorm/mul_1", "op": "Mul", "input": ["conv10/Relu", "conv10_bn/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv10_bn/batchnorm/add_1", "op": "Add", "input": ["conv10_bn/batchnorm/mul_1", "conv10_bn/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "avgpool10/Mean", "op": "Mean", "input": ["conv10_bn/batchnorm/add_1", "avgpool10/Mean/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "softmax/Softmax", "op": "Softmax", "input": ["avgpool10/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "fire9_expand_1x1/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "fire9_expand_1x1/bias", "shape": [256], "dtype": "float32"}, {"name": "fire7_expand_1x1/kernel", "shape": [1, 1, 48, 192], "dtype": "float32"}, {"name": "fire7_expand_1x1/bias", "shape": [192], "dtype": "float32"}, {"name": "fire6_expand_1x1/kernel", "shape": [1, 1, 48, 192], "dtype": "float32"}, {"name": "fire6_expand_1x1/bias", "shape": [192], "dtype": "float32"}, {"name": "fire5_expand_1x1/kernel", "shape": [1, 1, 32, 128], "dtype": "float32"}, {"name": "fire5_expand_1x1/bias", "shape": [128], "dtype": "float32"}, {"name": "fire4_expand_1x1/kernel", "shape": [1, 1, 32, 128], "dtype": "float32"}, {"name": "fire4_expand_1x1/bias", "shape": [128], "dtype": "float32"}, {"name": "fire3_expand_1x1/kernel", "shape": [1, 1, 16, 64], "dtype": "float32"}, {"name": "fire3_expand_1x1/bias", "shape": [64], "dtype": "float32"}, {"name": "fire2_expand_1x1/kernel", "shape": [1, 1, 16, 64], "dtype": "float32"}, {"name": "fire2_expand_1x1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1/kernel", "shape": [7, 7, 3, 96], "dtype": "float32"}, {"name": "fire7_squeeze_bn/batchnorm/mul", "shape": [48], "dtype": "float32"}, {"name": "conv1/bias", "shape": [96], "dtype": "float32"}, {"name": "fire2_squeeze/kernel", "shape": [1, 1, 96, 16], "dtype": "float32"}, {"name": "fire7_squeeze_bn/batchnorm/sub", "shape": [48], "dtype": "float32"}, {"name": "fire2_squeeze/bias", "shape": [16], "dtype": "float32"}, {"name": "fire2_squeeze_bn/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "fire2_squeeze_bn/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "conv10/kernel", "shape": [1, 1, 512, 7], "dtype": "float32"}, {"name": "fire2_expand_3x3/kernel", "shape": [3, 3, 16, 64], "dtype": "float32"}, {"name": "fire2_expand_3x3/bias", "shape": [64], "dtype": "float32"}, {"name": "fire7_expand_3x3/kernel", "shape": [3, 3, 48, 192], "dtype": "float32"}, {"name": "fire2_expand_merge/concat/axis", "shape": [], "dtype": "int32"}, {"name": "fire3_squeeze/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "conv10/bias", "shape": [7], "dtype": "float32"}, {"name": "fire3_squeeze/bias", "shape": [16], "dtype": "float32"}, {"name": "fire7_expand_3x3/bias", "shape": [192], "dtype": "float32"}, {"name": "fire3_squeeze_bn/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "fire3_squeeze_bn/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "fire3_expand_3x3/kernel", "shape": [3, 3, 16, 64], "dtype": "float32"}, {"name": "fire7_expand_merge/concat/axis", "shape": [], "dtype": "int32"}, {"name": "fire3_expand_3x3/bias", "shape": [64], "dtype": "float32"}, {"name": "fire3_expand_merge/concat/axis", "shape": [], "dtype": "int32"}, {"name": "fire4_squeeze/kernel", "shape": [1, 1, 128, 32], "dtype": "float32"}, {"name": "fire4_squeeze/bias", "shape": [32], "dtype": "float32"}, {"name": "fire9_squeeze/kernel", "shape": [1, 1, 384, 64], "dtype": "float32"}, {"name": "fire4_squeeze_bn/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "fire4_squeeze_bn/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "fire9_squeeze/bias", "shape": [64], "dtype": "float32"}, {"name": "fire4_expand_3x3/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "conv10_bn/batchnorm/mul", "shape": [7], "dtype": "float32"}, {"name": "fire4_expand_3x3/bias", "shape": [128], "dtype": "float32"}, {"name": "fire4_expand_merge/concat/axis", "shape": [], "dtype": "int32"}, {"name": "fire5_squeeze/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "fire9_squeeze_bn/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "fire5_squeeze/bias", "shape": [32], "dtype": "float32"}, {"name": "fire5_squeeze_bn/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "fire5_squeeze_bn/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "fire9_squeeze_bn/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "fire5_expand_3x3/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "fire5_expand_3x3/bias", "shape": [128], "dtype": "float32"}, {"name": "conv10_bn/batchnorm/sub", "shape": [7], "dtype": "float32"}, {"name": "fire5_expand_merge/concat/axis", "shape": [], "dtype": "int32"}, {"name": "fire6_squeeze/kernel", "shape": [1, 1, 256, 48], "dtype": "float32"}, {"name": "fire6_squeeze/bias", "shape": [48], "dtype": "float32"}, {"name": "fire9_expand_3x3/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "fire6_squeeze_bn/batchnorm/mul", "shape": [48], "dtype": "float32"}, {"name": "fire6_squeeze_bn/batchnorm/sub", "shape": [48], "dtype": "float32"}, {"name": "fire9_expand_3x3/bias", "shape": [256], "dtype": "float32"}, {"name": "fire6_expand_3x3/kernel", "shape": [3, 3, 48, 192], "dtype": "float32"}, {"name": "avgpool10/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "fire6_expand_3x3/bias", "shape": [192], "dtype": "float32"}, {"name": "fire6_expand_merge/concat/axis", "shape": [], "dtype": "int32"}, {"name": "fire7_squeeze/kernel", "shape": [1, 1, 384, 48], "dtype": "float32"}, {"name": "fire9_expand_merge/concat/axis", "shape": [], "dtype": "int32"}, {"name": "fire7_squeeze/bias", "shape": [48], "dtype": "float32"}]}]}